system/decomposeParDict
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location system;
    object decomposeParDict;
}

    numberOfSubdomains 6;
    
    method hierarchical;
    hierarchicalCoeffs
    {
        n (3 2 1);
        delta 0.001;
        order xyz;
    }

    distributed false;
    roots
    (
    );

